---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.ExternalDataTypeServerFailureResolutionExecutingEventArgs
source: html/8c9ad531-ed29-3cf4-759a-80f147514e0a.htm
---
# ExternalDataTypeServerFailureResolutionExecutingEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.